results/core6_v1/raw_batch2_20260710/incremental_blocks_6_10/20260710T222508_spike_H50_rep7/k6_stdout.log

     ✓ status 200

     checks.........................: 100.00% 181694 out of 181694
     data_received..................: 42 MB   73 kB/s
     data_sent......................: 19 MB   33 kB/s
     http_req_blocked...............: avg=4.45µs   min=922ns      med=3.66µs   max=24.01ms  p(90)=5.59µs   p(95)=6.56µs  
     http_req_connecting............: avg=281ns    min=0s         med=0s       max=23.96ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=16.7ms   min=1.65ms     med=16.4ms   max=61.37ms  p(90)=33.08ms  p(95)=37.46ms 
       { expected_response:true }...: avg=16.7ms   min=1.65ms     med=16.4ms   max=61.37ms  p(90)=33.08ms  p(95)=37.46ms 
   ✓ http_req_failed................: 0.00%   0 out of 181694
     http_req_receiving.............: avg=222.63µs min=7.92µs     med=112.05µs max=19.12ms  p(90)=495.68µs p(95)=672.77µs
     http_req_sending...............: avg=11.07µs  min=-1598171ns med=8.44µs   max=4.54ms   p(90)=15.04µs  p(95)=23.84µs 
     http_req_tls_handshaking.......: avg=0s       min=0s         med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=16.47ms  min=1.58ms     med=16.19ms  max=60.66ms  p(90)=32.69ms  p(95)=36.99ms 
     http_reqs......................: 181694  318.720465/s
     iteration_duration.............: avg=117.32ms min=101.78ms   med=117.03ms max=162.26ms p(90)=133.7ms  p(95)=138.1ms 
     iterations.....................: 181694  318.720465/s
     vus............................: 1       min=1                max=100
     vus_max........................: 100     min=100              max=100